; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=97, out_folder=htg/blocksworld/training, instance_id=77, seed=2101, goal_proportion=0.1

(define (problem blocksworld-77)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 - object)
 (:init 
    (arm-empty)
    (clear b30)
    (on-table b30)
    (clear b48)
    (on b48 b88)
    (on-table b88)
    (clear b80)
    (on-table b80)
    (clear b9)
    (on b9 b8)
    (on b8 b32)
    (on b32 b56)
    (on-table b56)
    (clear b95)
    (on b95 b11)
    (on b11 b91)
    (on b91 b45)
    (on b45 b3)
    (on b3 b70)
    (on-table b70)
    (clear b82)
    (on b82 b41)
    (on b41 b14)
    (on b14 b75)
    (on b75 b81)
    (on b81 b13)
    (on b13 b1)
    (on b1 b16)
    (on-table b16)
    (clear b34)
    (on b34 b92)
    (on b92 b25)
    (on-table b25)
    (clear b72)
    (on b72 b50)
    (on b50 b15)
    (on b15 b68)
    (on-table b68)
    (clear b4)
    (on b4 b51)
    (on b51 b44)
    (on b44 b84)
    (on b84 b6)
    (on b6 b62)
    (on b62 b33)
    (on-table b33)
    (clear b74)
    (on-table b74)
    (clear b86)
    (on b86 b96)
    (on b96 b2)
    (on-table b2)
    (clear b85)
    (on-table b85)
    (clear b29)
    (on-table b29)
    (clear b54)
    (on b54 b40)
    (on b40 b49)
    (on b49 b31)
    (on b31 b20)
    (on b20 b64)
    (on b64 b67)
    (on b67 b39)
    (on-table b39)
    (clear b35)
    (on b35 b43)
    (on-table b43)
    (clear b58)
    (on b58 b61)
    (on-table b61)
    (clear b42)
    (on b42 b55)
    (on b55 b53)
    (on b53 b89)
    (on-table b89)
    (clear b19)
    (on b19 b27)
    (on b27 b79)
    (on b79 b63)
    (on b63 b78)
    (on b78 b94)
    (on b94 b71)
    (on b71 b38)
    (on-table b38)
    (clear b65)
    (on b65 b57)
    (on b57 b59)
    (on b59 b76)
    (on b76 b37)
    (on b37 b46)
    (on b46 b26)
    (on-table b26)
    (clear b52)
    (on b52 b12)
    (on b12 b21)
    (on b21 b24)
    (on b24 b60)
    (on b60 b10)
    (on b10 b28)
    (on b28 b66)
    (on b66 b5)
    (on b5 b69)
    (on-table b69)
    (clear b22)
    (on b22 b87)
    (on b87 b17)
    (on b17 b73)
    (on b73 b83)
    (on b83 b18)
    (on b18 b77)
    (on-table b77)
    (clear b36)
    (on b36 b7)
    (on b7 b23)
    (on-table b23)
    (clear b97)
    (on b97 b47)
    (on b47 b90)
    (on-table b90)
    (clear b93)
    (on-table b93))
 (:goal  (and 
    (clear b3)
    (on b3 b9)
    (on b9 b1)
    (on b1 b6)
    (on b6 b5)
    (on b5 b7)
    (on b7 b8)
    (on-table b8)
    (clear b4)
    (on b4 b2)
    (on-table b2))))

; plan
1. (unstack b9 b8)
   deleted: (on b9 b8) (clear b9) (arm-empty)
   added: (holding b9) (clear b8)
   goals met: 2 of 11
2. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 2 of 11
3. (unstack b8 b32)
   deleted: (on b8 b32) (clear b8) (arm-empty)
   added: (holding b8) (clear b32)
   goals met: 2 of 11
4. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 3 of 11
5. (unstack b36 b7)
   deleted: (on b36 b7) (clear b36) (arm-empty)
   added: (holding b36) (clear b7)
   goals met: 3 of 11
6. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 3 of 11
7. (unstack b7 b23)
   deleted: (on b7 b23) (clear b7) (arm-empty)
   added: (holding b7) (clear b23)
   goals met: 3 of 11
8. (stack b7 b8)
   deleted: (clear b8) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b8)
   goals met: 4 of 11
9. (unstack b86 b96)
   deleted: (on b86 b96) (clear b86) (arm-empty)
   added: (holding b86) (clear b96)
   goals met: 4 of 11
10. (putdown b86)
   deleted: (holding b86)
   added: (clear b86) (arm-empty) (on-table b86)
   goals met: 4 of 11
11. (unstack b96 b2)
   deleted: (on b96 b2) (clear b96) (arm-empty)
   added: (holding b96) (clear b2)
   goals met: 4 of 11
12. (putdown b96)
   deleted: (holding b96)
   added: (clear b96) (arm-empty) (on-table b96)
   goals met: 4 of 11
13. (unstack b4 b51)
   deleted: (on b4 b51) (clear b4) (arm-empty)
   added: (holding b4) (clear b51)
   goals met: 3 of 11
14. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 5 of 11
15. (unstack b95 b11)
   deleted: (on b95 b11) (clear b95) (arm-empty)
   added: (holding b95) (clear b11)
   goals met: 5 of 11
16. (putdown b95)
   deleted: (holding b95)
   added: (clear b95) (arm-empty) (on-table b95)
   goals met: 5 of 11
17. (unstack b11 b91)
   deleted: (on b11 b91) (clear b11) (arm-empty)
   added: (holding b11) (clear b91)
   goals met: 5 of 11
18. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 5 of 11
19. (unstack b91 b45)
   deleted: (on b91 b45) (clear b91) (arm-empty)
   added: (holding b91) (clear b45)
   goals met: 5 of 11
20. (putdown b91)
   deleted: (holding b91)
   added: (clear b91) (arm-empty) (on-table b91)
   goals met: 5 of 11
21. (unstack b45 b3)
   deleted: (on b45 b3) (clear b45) (arm-empty)
   added: (holding b45) (clear b3)
   goals met: 6 of 11
22. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 6 of 11
23. (unstack b3 b70)
   deleted: (on b3 b70) (clear b3) (arm-empty)
   added: (holding b3) (clear b70)
   goals met: 5 of 11
24. (stack b3 b9)
   deleted: (clear b9) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b9)
   goals met: 7 of 11
25. (unstack b52 b12)
   deleted: (on b52 b12) (clear b52) (arm-empty)
   added: (holding b52) (clear b12)
   goals met: 7 of 11
26. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 7 of 11
27. (unstack b12 b21)
   deleted: (on b12 b21) (clear b12) (arm-empty)
   added: (holding b12) (clear b21)
   goals met: 7 of 11
28. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 7 of 11
29. (unstack b21 b24)
   deleted: (on b21 b24) (clear b21) (arm-empty)
   added: (holding b21) (clear b24)
   goals met: 7 of 11
30. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 7 of 11
31. (unstack b24 b60)
   deleted: (on b24 b60) (clear b24) (arm-empty)
   added: (holding b24) (clear b60)
   goals met: 7 of 11
32. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 7 of 11
33. (unstack b60 b10)
   deleted: (on b60 b10) (clear b60) (arm-empty)
   added: (holding b60) (clear b10)
   goals met: 7 of 11
34. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 7 of 11
35. (unstack b10 b28)
   deleted: (on b10 b28) (clear b10) (arm-empty)
   added: (holding b10) (clear b28)
   goals met: 7 of 11
36. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 7 of 11
37. (unstack b28 b66)
   deleted: (on b28 b66) (clear b28) (arm-empty)
   added: (holding b28) (clear b66)
   goals met: 7 of 11
38. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 7 of 11
39. (unstack b66 b5)
   deleted: (on b66 b5) (clear b66) (arm-empty)
   added: (holding b66) (clear b5)
   goals met: 7 of 11
40. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 7 of 11
41. (unstack b5 b69)
   deleted: (on b5 b69) (clear b5) (arm-empty)
   added: (holding b5) (clear b69)
   goals met: 7 of 11
42. (stack b5 b7)
   deleted: (clear b7) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b7)
   goals met: 8 of 11
43. (unstack b51 b44)
   deleted: (on b51 b44) (clear b51) (arm-empty)
   added: (holding b51) (clear b44)
   goals met: 8 of 11
44. (putdown b51)
   deleted: (holding b51)
   added: (clear b51) (arm-empty) (on-table b51)
   goals met: 8 of 11
45. (unstack b44 b84)
   deleted: (on b44 b84) (clear b44) (arm-empty)
   added: (holding b44) (clear b84)
   goals met: 8 of 11
46. (putdown b44)
   deleted: (holding b44)
   added: (clear b44) (arm-empty) (on-table b44)
   goals met: 8 of 11
47. (unstack b84 b6)
   deleted: (on b84 b6) (clear b84) (arm-empty)
   added: (holding b84) (clear b6)
   goals met: 8 of 11
48. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 8 of 11
49. (unstack b6 b62)
   deleted: (on b6 b62) (clear b6) (arm-empty)
   added: (holding b6) (clear b62)
   goals met: 8 of 11
50. (stack b6 b5)
   deleted: (clear b5) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b5)
   goals met: 9 of 11
51. (unstack b82 b41)
   deleted: (on b82 b41) (clear b82) (arm-empty)
   added: (holding b82) (clear b41)
   goals met: 9 of 11
52. (putdown b82)
   deleted: (holding b82)
   added: (clear b82) (arm-empty) (on-table b82)
   goals met: 9 of 11
53. (unstack b41 b14)
   deleted: (on b41 b14) (clear b41) (arm-empty)
   added: (holding b41) (clear b14)
   goals met: 9 of 11
54. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 9 of 11
55. (unstack b14 b75)
   deleted: (on b14 b75) (clear b14) (arm-empty)
   added: (holding b14) (clear b75)
   goals met: 9 of 11
56. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 9 of 11
57. (unstack b75 b81)
   deleted: (on b75 b81) (clear b75) (arm-empty)
   added: (holding b75) (clear b81)
   goals met: 9 of 11
58. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 9 of 11
59. (unstack b81 b13)
   deleted: (on b81 b13) (clear b81) (arm-empty)
   added: (holding b81) (clear b13)
   goals met: 9 of 11
60. (putdown b81)
   deleted: (holding b81)
   added: (clear b81) (arm-empty) (on-table b81)
   goals met: 9 of 11
61. (unstack b13 b1)
   deleted: (on b13 b1) (clear b13) (arm-empty)
   added: (holding b13) (clear b1)
   goals met: 9 of 11
62. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 9 of 11
63. (unstack b1 b16)
   deleted: (on b1 b16) (clear b1) (arm-empty)
   added: (holding b1) (clear b16)
   goals met: 9 of 11
64. (stack b1 b6)
   deleted: (clear b6) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b6)
   goals met: 10 of 11
65. (unstack b3 b9)
   deleted: (on b3 b9) (clear b3) (arm-empty)
   added: (holding b3) (clear b9)
   goals met: 8 of 11
66. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 9 of 11
67. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 9 of 11
68. (stack b9 b1)
   deleted: (clear b1) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b1)
   goals met: 10 of 11
69. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 9 of 11
70. (stack b3 b9)
   deleted: (clear b9) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b9)
   goals met: 11 of 11
